CREATE TABLE news (
id SERIAL,
caption VARCHAR(500),
text TEXT,
author VARCHAR(200)
)

INSERT INTO news
(caption, text, author)
VALUES
('Учёные нашли сходство между археоптериксами и курицами‍',
'Выяснилось, что они всё-таки обладали способностью подняться
в воздух при надвигающейся опасности, но из-за слабых крыльев
не находились долго в небе.
Французские палеонтологи выяснили, в чём сходство древних археоптериксо
в и обычных домашних кур. Статья, посвящённая этой работе, опубликована
в научном издании Nature.

Учёный Деннис Вётен из Европейского синхротронного центра в Гренобле
рассказал, что с помощью ускорителя частиц он и коллеги смогли просветить
хорошо сохранившиеся плечевые кости археоптерикса.

— Мы заметили, что их стенки были заметно тоньше, чем у современных им
динозавров, и очень похожи на кости птиц, — сказал он.
Благодаря исследованию специалисты пришли к выводу, что археоптериксы
могли подняться в воздух при надвигающейся опасности, но из-за слабых
крыльев не находились долго в небе. Они прыгали с ветки на ветку, так же,
как это способна сделать домашняя птица сейчас.
Археоптериксов считают одними из самых древних и примитивных родичей птиц.
И, по мнению учёных, после их научной работы можно предположить, что умение
летать было присуще всем пернатым динозаврам. Впрочем, специалисты всё равно
не могут понять, каким образом археоптериксы взмывали вверх. По словам Вётена,
"строение их крыльев никак не совместимо с манерой полёта современных птиц".',
'Андрей Довлатов'
)

INSERT INTO news
(caption, text, author)
VALUES
('«Яндекс.Браузер» для Windows научился разговаривать',
'Компания «Яндекс» объявила, что в настольной версии фирменного браузера появился
встроенный виртуальный помощник «Алиса». Благодаря этому нововведению пользователи
смогут с помощью голосовых команд выполнять различные действия, узнавать нужную информацию
и даже управлять компьютером, что существенно сэкономит время.
«Алиса» в «Яндекс.Браузере» для Windows позволяет голосом управлять
воспроизведением музыки, спрашивать о прогнозе погоды, новостях и курсе валют,
открывать сайты и программы, выключать или перезагружать компьютер. Помощника
можно попросить найти рецепт любимого блюда, открыть последнюю закрытую вкладку,
отключить звук или даже сыграть с ним в мини-игры.
Если же услуги виртуального помощника вам не нужны, то «Алису» можно отключить
в настройках «Яндекс.Браузера»',
'Wadym72'
)

INSERT INTO news
(caption, text, author)
VALUES
('Apple определилась с датой и местом презентации новых продуктов',
'Компания Apple официально объявила дату проведения ежегодной конференции для
разработчиков WWDC 2018. Как обычно, в центре внимания мероприятия будут обновлённые
версии операционных систем, но также ожидается презентация новых устройств.
Практически наверняка Apple представит на WWDC 2018 iOS 12, macOS 10.14, watchOS 5
и tvOS 12. По некоторым данным, ожидать кардинальных изменений в мобильной «операционке»
не стоит, так как компания решила больше не спешить с внедрением новых функций, а вместо
этого сконцентрируется на оптимизации.
Также есть много слухов, что на конференции будут представлены обновлённый MacBook Air
с Retina-дисплеем и новый iPad с тонкими рамками и системой распознавания лиц Face ID,
как в iPhone X.
Конференция для разработчиков WWDC 2018 пройдёт с 4 по 8 июня в конференц-центре McEnery
в Сан-Хосе, штат Калифорния.',
'Wadym72'
)